09.wc_object/test/fixtures/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def following?(user)
    active_relationships.where(following_id: user.id).exists?

INSERT INTO "relationships" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 4], ["following_id", 5], ["created_at", "2021-01-21 14:09:55.864793"], ["updated_at", "2021-01-21 14:09:55.864793"]]
---
  def follow(user)
    active_relationships.find_or_create_by!(following_id: user.id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 10]]
---
  def unfollow(user)
    relationship = active_relationships.find_by(following_id: user.id)
    relationship&.destroy!