09.wc_object/test/fixtures/app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
---
  def index
    @books = Book.order(id: :desc).page(params[:page])

INSERT INTO "books" ("title", "memo", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?)  [["title", "テスト本"], ["memo", "本本"], ["created_at", "2021-01-31 11:10:39.029879"], ["updated_at", "2021-01-31 11:10:39.029879"], ["author", ""]]
---
  def create
    @book = Book.new(book_params)

    if @book.save