09.wc_object/test/fixtures/app/controllers/reports_controller.rb

  def index
    @reports = Report.includes(:user).order(id: :desc).page(params[:page])
---
SELECT "reports".* FROM "reports" ORDER BY "reports"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reports"

  def show
    @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @report = current_user.reports.new(report_params)

    if @report.save
---
INSERT INTO "reports" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "test"], ["content", "test"], ["created_at", "2021-03-01 13:07:38.607114"], ["updated_at", "2021-03-01 13:07:38.607114"]]

  def update
    if @report.update(report_params)
---
UPDATE "reports" SET "content" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["content", "testtest"], ["updated_at", "2021-03-01 13:08:42.676916"], ["id", 1]]

  def destroy
    @report.destroy
---
DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 1]]

  def set_report
    @report = current_user.reports.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = ? AND "reports"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]