09.wc_object/test/fixtures/app/controllers/books/comments_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "aaaaaa"], ["user_id", 1], ["commentable_type", "Book"], ["commentable_id", 3], ["created_at", "2021-02-14 09:58:40.836139"], ["updated_at", "2021-02-14 09:58:40.836139"]]
---
  def create
    book = Book.find(params[:book_id])
    comment = book.comments.build(comment_params)
    comment.user = current_user
    # NOTE: 実装を複雑にしないよう、あえて保存失敗時の処理を考慮しないことにした（失敗時はシステムエラーとする）
    comment.save!