09.wc_object/test/fixtures/app/controllers/reports/comments_controller.rb

  def create
    report = Report.find(params[:report_id])
    comment = report.comments.build(comment_params)
    comment.user = current_user
    # NOTE: 実装を複雑にしないよう、あえて保存失敗時の処理を考慮しないことにした（失敗時はシステムエラーとする）
    comment.save!
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "aaa"], ["user_id", 1], ["commentable_type", "Report"], ["commentable_id", 1], ["created_at", "2021-02-14 10:30:55.750161"], ["updated_at", "2021-02-14 10:30:55.750161"]]